#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/edenmind/openarabic/runs/run-gxXVQGy2o6Bj6J19

Waiting for the plan to start...

Terraform v1.3.3
on linux_amd64
Initializing plugins and modules...
digitalocean_container_registry.repository: Refreshing state... [id=openarabic]
digitalocean_kubernetes_cluster.openarabic: Refreshing state... [id=80c937a0-f09e-425a-9ae8-f2be780d0049]
module.helm_charts.helm_release.loadtester: Refreshing state... [id=loadtester]
module.helm_charts.helm_release.grafana: Refreshing state... [id=grafana]
module.helm_charts.helm_release.istio-base: Refreshing state... [id=istio-base]
module.helm_charts.helm_release.istio-ingress: Refreshing state... [id=istio-ingress]
module.helm_charts.helm_release.metrics-server: Refreshing state... [id=metrics-server]
module.helm_charts.helm_release.istio-istiod: Refreshing state... [id=istio-istiod]
module.helm_charts.helm_release.flagger: Refreshing state... [id=flagger]
kubernetes_namespace.openarabic: Refreshing state... [id=openarabic]
kubernetes_namespace.loadtester: Refreshing state... [id=loadtester]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_database_cluster.mongodb-example will be created
  + resource "digitalocean_database_cluster" "mongodb-example" {
      + database             = (known after apply)
      + engine               = "mongodb"
      + host                 = (known after apply)
      + id                   = (known after apply)
      + name                 = "memorizer"
      + node_count           = 1
      + password             = (sensitive value)
      + port                 = (known after apply)
      + private_host         = (known after apply)
      + private_network_uuid = (known after apply)
      + private_uri          = (sensitive value)
      + region               = "ams3"
      + size                 = "db-s-1vcpu-1gb"
      + uri                  = (sensitive value)
      + urn                  = (known after apply)
      + user                 = (known after apply)
      + version              = "5"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @YunusAndreasson, Action: `pull_request`*